### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

https://pandas.pydata.org/about/index.html

### Pandas Series
A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

### Importing Pandas

In [3]:
import numpy as np
import pandas as pd

### Series from lists

In [4]:
# String
country = ['India', 'Pakistan', 'USA', 'Nepal', 'Srilanka']

pd.Series(country)

0       India
1    Pakistan
2         USA
3       Nepal
4    Srilanka
dtype: object

In [6]:
# integers
run = [29,45,37,58,38]

pd.Series(run)

0    29
1    45
2    37
3    58
4    38
dtype: int64

In [8]:
# custom index
marks = [80,77,90,88]
subjects = ['maths','english','science','hindi']

pd.Series(marks,index = subjects)

maths      80
english    77
science    90
hindi      88
dtype: int64